{
    "pl": {
        "storyTwo": {
            "intro": "Scenariusz testowy - Wielka Próba",
            "introHeader": "Skupcie się!",
            "introParagraphOne": "Nie traktujcie tego scenariusza jak drobiazg. To nie rurki z kremem. Właśnie zostaliście poważnymi testerami i macie ważne zadanie!",
            "introParagraphTwo": "Miejcie oczy szeroko otwarte i bądźcie czujni! Zwracajcie uwagę na każdy szczegół działania aplikacji, jeżeli jakiś błąd umknie waszej uwadze dzisiaj, w przyszłości może uniemożliwić zabawę prawdziwym turystom!",
            "questionOne": "Jak nazywa się patron parafii w Piskorzowie?",
            "incorrectMessageOne": "Niestety, to nie jest poprawna odpowiedź. Spróbuj ponownie.",
            "tipOne": "Podpowiedź: Przeczytaj opis poniżej.",
            "taskOne": "Zadanie 1",
            "taskOneHeader": "Gospoda w Piskorzowie",
            "taskOneImageAlt": "Rysowana panorama Piskorzowa",
            "taskImageTwoAlt": "Widokówka z gospodą w przedwojennym Piskorzowie",
            "taskOneParagraphOne": "Piskorzowska droga od zawsze była chętnie uczęszczanym traktem. Dziś nieco doskwiera nam wzmożony ruch, ale dawniej przemieszczanie się ludzi z Dzierżoniowa do Świdnicy stwarzało mieszkańcom idealne warunki do prowadzenia zajazdów i karczm. Jednym z takich miejsc była gospoda przy głównej drodze w Piskorzowie. Starsi mieszkańcy jeszcze wspominają jej dużą salę i liczne potańcówki do białego rana.",
            "taskOneQuestion": "Znajdź miejsce, w którym zostało wykonane zdjęcie. Podchodząc do miejsc ruchu samochodów zachowaj szczególną ostrożność.",
            "taskOneTip": "Musisz podejść możliwie blisko i uchwycić perspektywę zdjęcia. W opisie pod zadaniem znajdziesz więcej szczegółów.",
            "taskTwo": "Zadanie 2",
            "taskTwoHeader": "Masyw Ślęży",
            "taskTwoParagraphOne": "Mamy swoje, lepsze góry - Góry Sowie. :)",
            "taskTwoQuestion": "Podaj nazwę, drugiego najwyższego szczytu masywu Ślęży",
            "taskTwoTip": "Nasza aplikacja jest geoportalem, więc możesz śmiało z niego skorzystać.",
            "taskTwoImageAlt": "Widok na masyw Ślęży",
            "ending": "Brawo! Ukończyliście test",
            "endingHeader": "Dzięki za pomoc!",
            "endingParagraphOne": "Wyciągamy wnioski i pracujemy dalej. Teraz lećcie po pałkę. Jest za obiektem ze zdjęcia. Potem proszę zameldować się pod wiatą.",
            "taskThree": "Zadanie 3",
            "taskThreeHeader": "Zdobądź klucz",
            "taskThreeImageAlt": "Obraz altany",
            "taskThreeQuestion": "Potrzebujemy klucza!",
            "taskThreeTip": "Wisi na smyczy.",
            "taskThreeParagraphOne": "Zupełnie nie ważny tekst",
            "taskFour": "Zadanie 4",
            "taskFourHeader": "Użyj klucza",
            "taskFourImageAlt": "Obraz garaży",
            "taskFourQuestion": "Otwórz garaż zdobytym kluczem, a następnie przeczytaj tekst i zabierz z ziemi 2 piłki!. Tekst jest odpowiedzią",
            "taskFourTip": "Raczej wszystko jasne"
        },
        "noScenariosAvailable": "Brak dostępnych scenariuszy",
        "loadingScenarios": "Ładowanie scenariuszy...",
        "storyOneTitle": "Mieszkańcy kiedyś i dzisiaj",
        "storyTwoTitle": "Scenariusz testowy",
        "scenario": "Scenariusz",
        "testScenario": "Scenariusz testowy",
        "storyScenarioDescription": "Opis scenariusza testowego",
        "stepOne": "Kościół św. Jana Nepomucena",
        "stepOneSubheader": "Zabytkowy kościół św. Jana Nepomucena",
        "interiorSubheader": "Wnętrze kościoła",
        "historySubheader": "Historia ",
        "stepOneParagraphOne": "W Piskorzowie znajduje się zabytkowy kościół św. Jana Nepomucena, należący do piskorzowskiej parafii, zbudowany w XVI w., przebudowywany w 1730 i 1921. Wielkość parafii 1 360 osób. W XVI w. ewangelicy wznieśli kościół piskorzowski. Mimo iż luteranie w Piskorzowie stanowili większość, a tzw. „redukcja” miała obejmować jedynie świątynie wzniesione przez katolików, w 1654 r. kościół został „zredukowany”. Po 75 latach został przez katolików przebudowany, a w 1921 r. rozbudowany. Do 1967 r. był kościołem filialnym parafii św. Jakuba w Pieszycach.",
        "stepOneParagraphTwo": "Obecnie kościół jest bezstylową budowlą założoną na prostokącie z nieco węższym i niższym prezbiterium, do którego od północy dostawiono zakrystię. Nawę i prezbiterium nakryto ceramicznymi dachami dwuspadowymi, zakrystię przykrywa północna połać dachu prezbiterium. Ściana szczytowa zdobiona ceglanym gzymsem z fryzem arkadkowym i zwieńczona współczesną, murowaną sygnaturką trójarkadową. Wnętrze oświetlają półkoliście zamknięte okna w ceglanych opaskach. Wewnątrz wyposażenie z XVIII-XX w.",
        "save": "Zapisz",
        "cancel": "Anuluj",
        "terrainGame": "Gra terenowa",
        "terrainGameUnavailable": "Gra terenowa niedostępna na urządzeniu bez moduły GPS",
        "terrainGameModuleUnavailable": "Moduł gry terenowej niedostępny",
        "selectTerrainGame": "Wybierz grę terenową",
        "terrainGameUnavailableDescription": "Niestety na Twoim urządzeniu nie można uruchomić gry terenowej. Możesz przejść do trybu prezentacji.",
        "goToPresentation": "Przejdź do prezentacji",
        "villagePresentation": "Interaktywna prezentacja wsi",
        "gameTitle": "Piskorzów Interaktywnie",
        "navigation": {
            "backToHome": "Powrót do strony głównej"
        },
        "loading": {
            "initializing": "Inicjalizacja aplikacji...",
            "gpsInfo": "Sprawdzanie dostępu do lokalizacji GPS...",
            "status": {
                "loading": "Ładowanie aplikacji...",
                "components": "Inicjalizacja komponentów...",
                "gps": "Sprawdzanie uprawnień GPS...",
                "map": "Konfiguracja mapy...",
                "game": "Przygotowywanie gry terenowej..."
            }
        },
        "projectInfo": {
            "title": "Piskorzów Interaktywnie",
            "showInfo": "Pokaż informacje o projekcie",
            "aboutTitle": "O projekcie",
            "description1": "Witamy w interaktywnej grze terenowej w Piskorzowie! Jesteśmy mieszkańcami Piskorzowa i stworzyliśmy tę grę jako element opowieści o naszej wsi i jej mieszkańcach. Grę stworzyliśmy wspólnie z naszą lokalną młodzieżą podczas warsztatów programowania. Włożyliśmy w tę aplikację mnóstwo serca i pasji, abyście mogli lepiej poznać nasz dom.",
            "description2": "Opowieść o naszej wsi możesz poznać zarówno podczas pieszej wycieczki z telefonem jak i za ekranem komputera. Wybierz tylko odpowiedni tryb i postępuj zgodnie z instrukcjami. Gdybyś miał problem ze znalezieniem odpowiedzi na postawione pytanie, zajrzyj do opisów i podpowiedzi. Mamy nadzieję, że spędzisz z naszą grą kreatywny czas.",
            "description3": "Aplikacja korzysta z modułu GPS Twojego urządzenia, aby umożliwić Ci interakcję z otoczeniem i wykonywanie zadań w określonych lokalizacjach. Upewnij się, że masz włączony GPS i zezwoliłeś aplikacji na dostęp do lokalizacji.",
            "fundingTitle": "Informacje o finansowaniu",
            "euFunding": "Aplikacja została utworzona przez Fundację \"Wieś 2.0 Laboratorium Innowacji Wiejskich\" w ramach realizacji zadania \"Warsztaty z programowania dla lokalnej młodzieży na rzecz rozwoju Piskorzowa i publikacji Piskorzowskiej Gry Terenowej\". Sfinansowana została w ramach projektu \"Minigranty na Dolnym Śląsku - Konkurs dla młodych NGO i grup nieformalnych\" ze środków Stowarzyszenia Odra - Niemien oraz Narodowego Instytutu Wolności - Centrum Rozwoju Społeczeństwa Obywatelskiego.",
            "contactTitle": "Kontakt z Fundacją",
            "contactText": "Masz pytania dotyczące aplikacji, chcesz skontaktować się z twórcami lub jesteś zainteresowany wdrożeniem podobnego projektu w swojej miejscowości? Napisz do nas:",
            "dontShowAgain": "Nie pokazuj ponownie",
            "close": "Zamknij",
            "startExploring": "Zacznij eksplorację",
            "logosText": "Wieś 2.0 Laboratorium Innowacji Wiejskich"
        },
        "gameCard": {
            "title": "Gra terenowa Piskorzów",
            "openGame": "Otwórz grę terenową",
            "close": "Zamknij",
            "maximize": "Maksymalizuj",
            "minimize": "Minimalizuj",
            "restore": "Przywróć",
            "welcome": "Witaj w grze terenowej!",
            "instructions": "Eksploruj wieś Piskorzów i odkrywaj jej tajemnice. Używaj mapy, aby znaleźć punkty zainteresowania i wykonuj zadania.",
            "locations": {
                "title": "Lokalizacje do odkrycia",
                "content": "W grze czekają na Ciebie różne miejsca: historyczne budynki, pomniki, punkty widokowe i ukryte skarby. Każda lokalizacja ma swoją unikalną historię."
            },
            "challenges": {
                "title": "Wyzwania i zadania",
                "content": "Wykonuj ciekawe zadania, rozwiązuj zagadki i zbieraj punkty. Im więcej odkryjesz, tym więcej dowiesz się o historii Piskorzowa."
            },
            "team": {
                "title": "Gra zespołowa",
                "content": "Możesz grać solo lub w zespole. Współpracujcie, aby rozwiązać trudniejsze zagadki i odkryć wszystkie sekrety wsi."
            },
            "rules": {
                "title": "Zasady gry",
                "rule": "Zasada",
                "description": "Opis zasady"
            },
            "tips": {
                "title": "Przydatne wskazówki",
                "tip": "Wskazówka"
            }
        },
        "storyView": {
            "loadingScenario": "Ładowanie scenariusza...",
            "loadingError": "Błąd ładowania:",
            "scenarioNotFound": "Nie znaleziono scenariusza.",
            "scenario": "Scenariusz",
            "previousStep": "Poprzedni krok",
            "nextStep": "Następny krok",
            "stepCounter": "Krok {current} z {total}",
            "focusStepOnMap": "Pokaż krok na mapie",
            "gpsAccessRequired": "Gra terenowa wymaga dostępu do lokalizacji GPS",
            "gpsPermissionDenied": "Brak uprawnień do lokalizacji. Proszę zezwolić na dostęp do lokalizacji w ustawieniach przeglądarki.",
            "gpsUnavailable": "Lokalizacja GPS jest niedostępna. Sprawdź czy GPS jest włączony na urządzeniu.",
            "gpsTimeout": "Przekroczono czas oczekiwania na sygnał GPS. Spróbuj ponownie.",
            "gpsLowAccuracy": "Zbyt niska dokładność GPS ({accuracy}m). Spróbuj przenieść się w miejsce z lepszym sygnałem.",
            "gpsGenericError": "Wystąpił błąd podczas włączania GPS. Spróbuj ponownie.",
            "gpsStartError": "Nie udało się uruchomić śledzenia GPS.",
            "retryGps": "Spróbuj ponownie"
        },
        "game": {
            "resumeDialogTitle": "Wykryto zapisane postępy gry",
            "resumeDialogText": "Czy chcesz kontynuować od ostatniego miejsca, czy zacząć od nowa?",
            "resumeDialogContinue": "Kontynuuj",
            "resumeDialogRestart": "Zacznij od nowa"
        },
        "stepView": {
            "noStepAvailable": "Brak dostępnego kroku",
            "sectionContent": "Opis",
            "sectionTask": "Wyzwanie",
            "nextStep": "Następny krok",
            "backToPresentation": "Powrót do scenariuszy",
            "leaveDialogTitle": "Czy na pewno chcesz opuścić grę terenową?",
            "leaveDialogText": "Twój postęp zostanie zapisany. Możesz wrócić później i kontynuować od tego miejsca.",
            "leaveDialogYes": "Tak",
            "leaveDialogNo": "Nie"
        },
        "task": {
            "yourAnswer": "Twoja odpowiedź",
            "submit": "Zatwierdź",
            "correct": "Poprawna odpowiedź!",
            "incorrect": "Niepoprawna odpowiedź. Spróbuj ponownie.",
            "showTip": "Pokaż wskazówkę",
            "hideTip": "Ukryj wskazówkę",
            "tip": "Wskazówka",
            "tooFarTitle": "Za daleko od miejsca",
            "tooFarMessage": "Musisz podejść bliżej do miejsca (odległość: {distance}m)",
            "approachTarget": "Podejdź bliżej celu! Brakuje jeszcze",
            "meters": "metrów.",
            "metersTwo": "metry.",
            "meter": "metr."
        }
    },
    "en": {
        "storyTwo": {
            "intro": "Test Scenario - The Great Trial",
            "introHeader": "Focus!",
            "introParagraphOne": "Don't treat this scenario as a trifle. This is not a piece of cake. I could just as well have written something in Latin and you would be testing it along with the translator!",
            "introParagraphTwo": "Keep your eyes wide open and be vigilant! Pay attention to every detail, if some error escapes your attention today, in the future it may prevent real tourists from having fun!",
            "questionOne": "What is the name of the patron of the parish in Piskorzów?",
            "incorrectMessageOne": "Unfortunately, this is not the correct answer. Try again.",
            "tipOne": "Hint: Read the description below."
        },
        "noScenariosAvailable": "No scenarios available",
        "loadingScenarios": "Loading scenarios...",
        "storyOneTitle": "Village then and now",
        "storyTwoTitle": "Test scenario",
        "scenario": "Scenario",
        "testScenario": "Test scenario",
        "storyScenarioDescription": "Test scenario description",
        "stepOne": "Church of St. John of Nepomuk",
        "stepOneSubheader": "Historic Church of St. John of Nepomuk",
        "interiorSubheader": "Interior of the church",
        "historySubheader": "History",
        "stepOneParagraphOne": "In Piskorzów there is a historic church of St. John of Nepomuk, belonging to the Piskorzów parish, built in the 16th century, rebuilt in 1730 and 1921. The parish size is 1,360 people. In the 16th century, Protestants erected the Piskorzów church. Although Lutherans in Piskorzów constituted the majority, and the so-called \"reduction\" was supposed to include only temples erected by Catholics, in 1654 the church was \"reduced\". After 75 years it was rebuilt by Catholics, and in 1921 it was expanded. Until 1967 it was a filial church of the parish of St. James in Pieszyce.",
        "stepOneParagraphTwo": "Currently, the church is a styleless building based on a rectangle with a slightly narrower and lower presbytery, to which a sacristy was added from the north. The nave and presbytery are covered with ceramic gable roofs, the sacristy is covered by the northern slope of the presbytery roof. The gable wall is decorated with a brick cornice with an arcade frieze and crowned with a contemporary, brick three-arcade signature. The interior is illuminated by semicircularly closed windows in brick frames. Inside, furnishings from the 18th-20th centuries.",
        "save": "Save",
        "cancel": "Cancel",
        "terrainGame": "Village Quest",
        "terrainGameUnavailable": "Terrain game unavailable on device without GPS module",
        "terrainGameModuleUnavailable": "Terrain game module unavailable",
        "terrainGameUnavailableDescription": "Unfortunately, the terrain game cannot be launched on your device. You can switch to presentation mode.",
        "goToPresentation": "Go to presentation",
        "selectTerrainGame": "Select terrain game",
        "villagePresentation": "Interactive Village Presentation",
        "gameTitle": "Piskorzów Interactively",
        "navigation": {
            "backToHome": "Back to home"
        },
        "loading": {
            "initializing": "Initializing application...",
            "gpsInfo": "Checking GPS location access...",
            "status": {
                "loading": "Loading application...",
                "components": "Initializing components...",
                "gps": "Checking GPS permissions...",
                "map": "Configuring map...",
                "game": "Preparing terrain game..."
            }
        },
        "projectInfo": {
            "title": "Piskorzów Interactively",
            "showInfo": "Show project information",
            "aboutTitle": "About the project",
            "description1": "Welcome to the interactive field game in Piskorzów! We are residents of Piskorzów and created this game as part of the story about our village and its inhabitants. We created the game together with our local youth during programming workshops. We put a lot of heart and passion into this application so that you can get to know our home better.",
            "description2": "The story of our village can be discovered both during a walk with your phone and behind a computer screen. Just choose the right mode and follow the instructions. If you have trouble finding the answer to a question, check the descriptions and hints. We hope you spend creative time with our game.",
            "description3": "The application uses your device's GPS module to allow you to interact with your surroundings and complete tasks in specific locations. Make sure your GPS is enabled and that you've allowed the app to access your location.",
            "fundingTitle": "Funding information",
            "euFunding": "The application was created by the Foundation \"Village 2.0 Rural Innovation Laboratory\" as part of the implementation of the task \"Programming workshops for local youth for the development of Piskorzów and the publication of the Piskorzów Field Game\". It was financed under the project \"Mini-grants in Lower Silesia - Competition for young NGOs and informal groups\" from the funds of the Odra-Niemen Association and the National Freedom Institute - Center for the Development of Civil Society.",
            "contactTitle": "Contact the Foundation",
            "contactText": "Do you have questions about the app, want to contact the creators, or are you interested in implementing the project in your area? Write to us at:",
            "dontShowAgain": "Don't show again",
            "close": "Close",
            "startExploring": "Start exploring",
            "logosText": "Village 2.0 Rural Innovation Laboratory"
        },
        "gameCard": {
            "title": "Piskorzów Village Quest",
            "openGame": "Open village quest",
            "close": "Close",
            "maximize": "Maximize",
            "minimize": "Minimize",
            "restore": "Restore",
            "welcome": "Welcome to the village quest!",
            "instructions": "Explore Piskorzów village and discover its secrets. Use the map to find points of interest and complete tasks.",
            "locations": {
                "title": "Locations to discover",
                "content": "Various places await you in the game: historic buildings, monuments, viewpoints, and hidden treasures. Each location has its unique story."
            },
            "challenges": {
                "title": "Challenges and tasks",
                "content": "Complete interesting tasks, solve puzzles, and collect points. The more you discover, the more you'll learn about Piskorzów's history."
            },
            "team": {
                "title": "Team play",
                "content": "You can play solo or in a team. Collaborate to solve more difficult puzzles and discover all the village secrets."
            },
            "rules": {
                "title": "Game rules",
                "rule": "Rule",
                "description": "Rule description"
            },
            "tips": {
                "title": "Useful tips",
                "tip": "Tip"
            }
        },
        "storyView": {
            "loadingScenario": "Loading scenario...",
            "loadingError": "Loading error:",
            "scenarioNotFound": "Scenario not found.",
            "scenario": "Scenario",
            "previousStep": "Previous step",
            "nextStep": "Next step",
            "stepCounter": "Step {current} of {total}",
            "focusStepOnMap": "Show step on map",
            "gpsAccessRequired": "Terrain game requires GPS location access",
            "gpsPermissionDenied": "Location permission denied. Please allow location access in browser settings.",
            "gpsUnavailable": "GPS location is unavailable. Check if GPS is enabled on your device.",
            "gpsTimeout": "GPS signal timeout. Please try again.",
            "gpsLowAccuracy": "GPS accuracy too low ({accuracy}m). Try moving to a location with better signal.",
            "gpsGenericError": "An error occurred while enabling GPS. Please try again.",
            "gpsStartError": "Failed to start GPS tracking.",
            "retryGps": "Try again"
        },
        "game": {
            "resumeDialogTitle": "Saved game progress detected",
            "resumeDialogText": "Do you want to continue from where you left off or start over?",
            "resumeDialogContinue": "Continue",
            "resumeDialogRestart": "Start over"
        },
        "stepView": {
            "noStepAvailable": "No step available",
            "sectionContent": "Description",
            "sectionTask": "Challenge",
            "nextStep": "Next step",
            "backToPresentation": "Back to presentation",
            "leaveDialogTitle": "Are you sure you want to leave the field game?",
            "leaveDialogText": "Your progress will be saved. You can return later and continue from this point.",
            "leaveDialogYes": "Yes",
            "leaveDialogNo": "No"
        },
        "task": {
            "yourAnswer": "Your answer",
            "submit": "Submit",
            "correct": "Correct answer!",
            "incorrect": "Incorrect answer. Try again.",
            "showTip": "Show tip",
            "hideTip": "Hide tip",
            "tip": "Tip",
            "tooFarTitle": "Too far from location",
            "tooFarMessage": "You need to get closer to the location (distance: {distance}m)",
            "approachTarget": "Get closer to the target! You still need",
            "meters": "meters.",
            "metersTwo": "meters.",
            "meter": "meter."
        }
    }
}
